backend/lib/tasks/test.rake

  task :run, [] => [:environment] do |t, args|
    user = User.all.first
    event = Event.create!(user: user, description: "this is an event", start_at: DateTime.now, end_at: DateTime.now + 15.minutes)
    puts event.inspect
    puts "HI"
    puts user.events.count
    puts user.events.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "events" ("description", "start_at", "end_at", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = ? ORDER BY "events"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]