hawkhacks-backend/app/controllers/events_controller.rb

INSERT INTO "events" ("description", "start_at", "end_at", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @event = Event.create!(user: @user, title: params[:title], description: params[:description], start_at: DateTime.parse(params[:start_at]), end_at: DateTime.parse(params[:end_at]), theme: params[:theme], longitude: params[:longitude], latitude: params[:latitude])